In [34]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [35]:
df = pd.read_csv('nba.csv')
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [36]:
df.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [37]:
df.drop(columns=['Number','College'],inplace=True)

In [38]:
df.isnull().sum()

Name         1
Team         1
Position     1
Age          1
Height       1
Weight       1
Salary      12
dtype: int64

In [39]:
df.dtypes

Name         object
Team         object
Position     object
Age         float64
Height       object
Weight      float64
Salary      float64
dtype: object

In [40]:
df['Name'] = df['Name'].ffill()
df['Team'] = df['Team'].ffill()
df['Position'] = df['Position'].ffill()
df['Height'] = df['Height'].ffill()

In [41]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Weight'] = df['Weight'].fillna(df['Weight'].mean())
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())

In [42]:
df.isnull().sum()

Name        0
Team        0
Position    0
Age         0
Height      0
Weight      0
Salary      0
dtype: int64

In [43]:
df.median()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_5692\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Age            26.0
Weight        220.0
Salary    2880600.0
dtype: float64

In [44]:
df.mode()

          Name                  Team Position   Age Height  Weight    Salary
0  Jeff Withey  New Orleans Pelicans       SG  24.0    6-9   220.0  947276.0

In [45]:
df.mean()

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_5692\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age       2.693873e+01
Weight    2.215230e+02
Salary    4.842684e+06
dtype: float64

In [46]:
df['Salary'].mean()

4842684.105381166

In [47]:
df['Age'].value_counts

<bound method IndexOpsMixin.value_counts of 0      25.000000
1      25.000000
2      27.000000
3      22.000000
4      29.000000
         ...
453    26.000000
454    24.000000
455    26.000000
456    26.000000
457    26.938731
Name: Age, Length: 458, dtype: float64>

In [48]:
df.groupby(['Team','Position']).first()

                                         Name   Age Height  Weight      Salary
Team               Position
Atlanta Hawks      C               Al Horford  30.0   6-10   245.0  12000000.0
                   PF          Kris Humphries  31.0    6-9   235.0   1000000.0
                   PG         Dennis Schroder  22.0    6-1   172.0   1763400.0
                   SF           Kent Bazemore  26.0    6-5   201.0   2000000.0
                   SG        Tim Hardaway Jr.  24.0    6-6   205.0   1304520.0
...                                       ...   ...    ...     ...         ...
Washington Wizards C            Marcin Gortat  32.0   6-11   240.0  11217391.0
                   PF             Drew Gooden  34.0   6-10   250.0   3300000.0
                   PG          Ramon Sessions  30.0    6-3   190.0   2170465.0
                   SF            Jared Dudley  30.0    6-7   225.0   4375000.0
                   SG           Alan Anderson  33.0    6-6   220.0   4000000.0

[149 rows x 5 columns]

In [49]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [50]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [51]:
iris['sepal_length'].value_counts

<bound method IndexOpsMixin.value_counts of 0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64>

In [52]:
iris['sepal_width'].value_counts

<bound method IndexOpsMixin.value_counts of 0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64>

In [53]:
iris['petal_length'].value_counts

<bound method IndexOpsMixin.value_counts of 0      1.4
1      1.4
2      1.3
3      1.5
4      1.4
      ...
145    5.2
146    5.0
147    5.2
148    5.4
149    5.1
Name: petal_length, Length: 150, dtype: float64>

In [54]:
iris['petal_width'].value_counts

<bound method IndexOpsMixin.value_counts of 0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64>

In [55]:
iris_groupby = iris.groupby(by='species')

In [56]:
iris_groupby.std()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          0.352490     0.379064      0.173664     0.105386
versicolor      0.516171     0.313798      0.469911     0.197753
virginica       0.635880     0.322497      0.551895     0.274650

In [57]:
iris_groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [58]:
iris_groupby.median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [59]:
iris_groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [60]:
iris_groupby.max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

In [61]:
iris_groupby.quantile()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [62]:
iris['sepal_length'].describe().transpose()

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: sepal_length, dtype: float64

In [63]:
iris['sepal_width'].describe().transpose()

count    150.000000
mean       3.057333
std        0.435866
min        2.000000
25%        2.800000
50%        3.000000
75%        3.300000
max        4.400000
Name: sepal_width, dtype: float64

In [64]:
iris['petal_length'].describe().transpose()

count    150.000000
mean       3.758000
std        1.765298
min        1.000000
25%        1.600000
50%        4.350000
75%        5.100000
max        6.900000
Name: petal_length, dtype: float64

In [65]:
iris['petal_width'].describe().transpose()

count    150.000000
mean       1.199333
std        0.762238
min        0.100000
25%        0.300000
50%        1.300000
75%        1.800000
max        2.500000
Name: petal_width, dtype: float64